// Import Swiper React components
import { Swiper, SwiperSlide } from "swiper/react";

// import required modules
import { Navigation } from "swiper/modules";

// Import Swiper styles
import "swiper/css";
import "swiper/css/navigation";

const FeedbackSwiper = () => {
  return (
    <div>
      <Swiper modules={[Navigation]} navigation>
        <SwiperSlide>
          <div className="flex flex-col items-center">
            {/* <div className="flex w-[88px] h-[88px] rounded-full overflow-hidden">
              <img src="dist/images/users/1.png" alt="" /> 
            </div> */}
            <p className="font-Vazir font-normal text-base text-center tracking-tighter mx-10 lg:mx-[154px] mt-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. در این صورت می
              توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط
              سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
              استفاده قرار گیرد.
            </p>
            <span className="mt-8 font-VazirBlack">مریم نادری</span>
          </div>
        </SwiperSlide>

        <SwiperSlide>
          <div className="flex flex-col items-center">
            {/* <div className="flex w-[88px] h-[88px] rounded-full overflow-hidden">
              <img src="dist/images/users/2.png" alt="" /> 
            </div> */}
            <p className="font-Vazir font-normal text-base text-center tracking-tighter mx-10 lg:mx-[154px] mt-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. در این صورت می
              توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط
              سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
              استفاده قرار گیرد.
            </p>
            <span className="mt-8 font-VazirBlack">علی کلاهدوز</span>
          </div>
        </SwiperSlide>

        <SwiperSlide>
          <div className="flex flex-col items-center">
            {/* <div className="flex w-[88px] h-[88px] rounded-full overflow-hidden">
               <img src="dist/images/users/3.jpg" alt="" /> 
            </div> */}
            <p className="font-Vazir font-normal text-base text-center tracking-tighter mx-10 lg:mx-[154px] mt-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. در این صورت می
              توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط
              سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
              استفاده قرار گیرد.
            </p>
            <span className="mt-8 font-VazirBlack">بیژن صدیق</span>
          </div>
        </SwiperSlide>

        <SwiperSlide>
          <div className="flex flex-col items-center">
            {/* <div className="flex w-[88px] h-[88px] rounded-full overflow-hidden">
               <img src="dist/images/users/4.jpg" alt="" /> 
            </div> */}
            <p className="font-Vazir font-normal text-base text-center tracking-tighter mx-10 lg:mx-[154px] mt-8">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. در این صورت می
              توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط
              سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
              استفاده قرار گیرد.
            </p>
            <span className="mt-8 font-VazirBlack">نسترن علی پور</span>
          </div>
        </SwiperSlide>
      </Swiper>
    </div>
  );
};

export default FeedbackSwiper;
